Revit 2027 API
RebarShapeConstraintAngleFromFixedDir Class
 A constraint which can be applied to a RebarShapeSegment and drives the angle of the segment relative to a fixed direction in UV-space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintAngleFromFixedDir : RebarShapeConstraint
Public Class RebarShapeConstraintAngleFromFixedDir
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintAngleFromFixedDir : public RebarShapeConstraint
type RebarShapeConstraintAngleFromFixedDir =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintAngleFromFixedDir type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintAngleFromFixedDir |  Create an angular constraint.
Top
Properties
Name | Description
Direction |  A fixed direction in UV-space. The parameter will drive the segment's angle relative to this direction.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RebarShapeConstraint)
Sign |  When the sign is 1, the Direction is rotated clockwise by the angle's value. When -1, the Direction is rotated counter-clockwise.
Top
Methods
Name | Description
Dispose
(Inherited from RebarShapeConstraint)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParamId |  Return the Id of the parameter associated with this constraint.
(Inherited from RebarShapeConstraint)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace